{
  "version": 2,
  "description": "Precomputed academic vocabulary index. Runtime selection reads this index and sends only selected daily words to the LLM. learning_sequence starts with curated math/science basics.",
  "stage_order": [
    "cn_middle_school",
    "cn_high_school",
    "cn_high_school_extension"
  ],
  "category_order": [
    "math_operations",
    "word_problem_signals",
    "academic_verbs",
    "geometry_measurement",
    "fractions_decimals",
    "science_process",
    "data_statistics",
    "life_science",
    "physical_science",
    "earth_science",
    "math",
    "science",
    "academic",
    "general_academic"
  ],
  "daily_category_plan": [
    "math_operations",
    "word_problem_signals",
    "academic_verbs",
    "geometry_measurement",
    "fractions_decimals",
    "science_process",
    "data_statistics",
    "life_science",
    "physical_science",
    "earth_science"
  ],
  "learning_sequence": [
    "sum",
    "difference",
    "product",
    "quotient",
    "factor",
    "multiple",
    "estimate",
    "approximately",
    "altogether",
    "remaining",
    "fewer",
    "increase",
    "decrease",
    "compare",
    "explain",
    "justify",
    "evidence",
    "observe",
    "predict",
    "measure",
    "perimeter",
    "area",
    "volume",
    "length",
    "width",
    "height",
    "ratio",
    "equivalent",
    "simplify",
    "fraction",
    "decimal",
    "numerator",
    "denominator",
    "data",
    "average",
    "range",
    "ecosystem",
    "habitat",
    "adaptation",
    "force",
    "motion",
    "energy",
    "weathering",
    "erosion",
    "climate",
    "add",
    "subtract",
    "multiply",
    "divide",
    "operation",
    "calculate",
    "compute",
    "total",
    "equal",
    "unequal",
    "double",
    "triple",
    "halve",
    "value",
    "expression",
    "equation",
    "solution",
    "variable",
    "constant",
    "coefficient",
    "term",
    "more",
    "less",
    "greater",
    "least",
    "greatest",
    "combined",
    "together",
    "separate",
    "each",
    "per",
    "rate",
    "unit",
    "discount",
    "tax",
    "profit",
    "loss",
    "change",
    "initial",
    "final",
    "missing",
    "percent",
    "percentage",
    "proportion",
    "proportional",
    "improper",
    "mixed",
    "reciprocal",
    "convert",
    "round",
    "place value",
    "tenths",
    "hundredths",
    "thousandths",
    "integer",
    "negative",
    "positive",
    "absolute value",
    "angle",
    "degree",
    "line",
    "ray",
    "segment",
    "parallel",
    "perpendicular",
    "vertex",
    "vertices",
    "polygon",
    "triangle",
    "quadrilateral",
    "rectangle",
    "square",
    "circle",
    "radius",
    "diameter",
    "circumference",
    "surface area",
    "coordinate",
    "axis",
    "plane",
    "base",
    "face",
    "edge",
    "mean",
    "median",
    "mode",
    "table",
    "graph",
    "chart",
    "plot",
    "bar graph",
    "line plot",
    "scatter plot",
    "frequency",
    "survey",
    "sample",
    "population",
    "probability",
    "outcome",
    "random",
    "trend",
    "maximum",
    "minimum",
    "analyze",
    "describe",
    "identify",
    "classify",
    "summarize",
    "infer",
    "evaluate",
    "support",
    "contrast",
    "represent",
    "model",
    "solve",
    "prove",
    "reason",
    "organize",
    "interpret",
    "apply",
    "determine",
    "conclude",
    "revise",
    "hypothesis",
    "experiment",
    "investigate",
    "control",
    "independent variable",
    "dependent variable",
    "procedure",
    "result",
    "claim",
    "reasoning",
    "accurate",
    "precise",
    "record",
    "trial",
    "observation",
    "conclusion",
    "system",
    "organism",
    "species",
    "community",
    "cell",
    "tissue",
    "organ",
    "function",
    "structure",
    "trait",
    "inherit",
    "genetic",
    "reproduce",
    "survive",
    "consumer",
    "producer",
    "decomposer",
    "food chain",
    "food web",
    "photosynthesis",
    "respiration",
    "competition",
    "predator",
    "prey",
    "matter",
    "mass",
    "weight",
    "density",
    "particle",
    "atom",
    "molecule",
    "element",
    "compound",
    "mixture",
    "solid",
    "liquid",
    "gas",
    "temperature",
    "thermal",
    "conductor",
    "insulator",
    "magnet",
    "electricity",
    "circuit",
    "friction",
    "gravity",
    "speed",
    "velocity",
    "acceleration",
    "rock",
    "mineral",
    "sediment",
    "fossil",
    "soil",
    "landform",
    "plate",
    "earthquake",
    "volcano",
    "atmosphere",
    "ocean",
    "current",
    "tide",
    "water cycle",
    "evaporation",
    "condensation",
    "precipitation",
    "runoff",
    "groundwater",
    "renewable",
    "nonrenewable",
    "resource",
    "concept",
    "process",
    "pattern",
    "relationship",
    "cause",
    "effect",
    "similar",
    "different",
    "specific",
    "general",
    "complex",
    "simple",
    "method",
    "strategy",
    "section",
    "context",
    "source",
    "valid",
    "reliable",
    "significant",
    "aaronic",
    "abaction",
    "abanic",
    "abasic",
    "abaxial",
    "abbatial",
    "abdal",
    "abditive",
    "abetment",
    "abettal",
    "abeyance",
    "abidal",
    "abidance",
    "abietic",
    "ability",
    "abiogeny",
    "abiology",
    "abiosis",
    "abiotic",
    "ablation",
    "ablative",
    "ablution",
    "abnerval",
    "abneural",
    "abnormal",
    "aboral",
    "abortion",
    "abortive",
    "abrasion",
    "abrasive",
    "absence",
    "absonous",
    "abulic",
    "abusion",
    "abusious",
    "abusive",
    "abutment",
    "abuttal",
    "abysmal",
    "abyssal",
    "academic",
    "acalycal",
    "acapnial",
    "acarpous",
    "acaudal",
    "acaulous",
    "acclinal",
    "accretal",
    "accrual",
    "accusal",
    "accusive",
    "acemetic",
    "acentric",
    "acephal",
    "acerbic",
    "acerbity",
    "acerous",
    "acetal",
    "acetic",
    "acetonic",
    "acetous",
    "aceturic",
    "acetylic",
    "achenial",
    "acholic",
    "acholous",
    "achordal",
    "achromic",
    "achroous",
    "achylous",
    "achymous",
    "acidic",
    "acidific",
    "acidity",
    "acidotic",
    "aciduric",
    "acieral",
    "acinetic",
    "acinic",
    "acinous",
    "aclastic",
    "aclinal",
    "aclinic",
    "acmatic",
    "acmic",
    "acnodal",
    "acoelous",
    "acologic",
    "acolous",
    "acomous",
    "aconic",
    "aconital",
    "aconitic",
    "acopic",
    "acosmic",
    "acoustic",
    "acranial",
    "acridic",
    "acridity",
    "acroatic",
    "acromial",
    "acrostic",
    "acrotic",
    "acrylic",
    "actinal",
    "actinic",
    "action",
    "actional",
    "active",
    "activity",
    "actual",
    "acuation",
    "acuity",
    "acyclic",
    "acyetic",
    "adagial",
    "adamic",
    "adamical",
    "adamitic",
    "adance",
    "adangle",
    "adaption",
    "adaptive",
    "adatom",
    "adaxial",
    "adda",
    "addable",
    "addax",
    "addebted",
    "added",
    "addedly",
    "addend",
    "addenda",
    "addendum",
    "adder",
    "addible",
    "addicent",
    "addict",
    "addicted",
    "addie",
    "addiment",
    "addition",
    "additive",
    "additory",
    "addle",
    "addlings",
    "addlins",
    "addorsed",
    "address",
    "addrest",
    "addu",
    "adduce",
    "adducent",
    "adducer",
    "adduct",
    "adductor",
    "addy",
    "adendric",
    "adenylic",
    "adhesion",
    "adhesive",
    "adiation",
    "adicity",
    "adipic",
    "adipinic",
    "adipous",
    "adipsic",
    "adipsous",
    "adital",
    "admedial",
    "admedian",
    "admiral",
    "adnation",
    "adnerval",
    "adneural",
    "adnexal",
    "adonic",
    "adoption",
    "adoptive",
    "adoral",
    "adradial",
    "adrectal",
    "adrenal",
    "adriatic",
    "adumbral",
    "aduncity",
    "aduncous",
    "adustion",
    "advance",
    "advisal",
    "advisive",
    "adynamic",
    "aecial",
    "aecidial",
    "aedilic",
    "aedility",
    "aeneous",
    "aeolic",
    "aeonial",
    "aeration",
    "aerial",
    "aeric",
    "aerical",
    "aerobic",
    "aerobion",
    "aesopic",
    "afetal",
    "affiance",
    "affinal",
    "affinity",
    "affixal",
    "afforce",
    "affusion",
    "afric",
    "agacella",
    "agal",
    "agamic",
    "agamous",
    "agaric",
    "agaricic",
    "agarwal",
    "agastric",
    "agenesic",
    "agential",
    "agentive",
    "ageusic",
    "agility",
    "aglance",
    "aglossal",
    "agnathic",
    "agnatic",
    "agnation",
    "agnostic",
    "agogic",
    "agonal",
    "agonic",
    "agpaitic",
    "agral",
    "agrapha",
    "agraphia",
    "agraphic",
    "agrestal",
    "agrestic",
    "agynous",
    "ahwal",
    "aidance",
    "ailment",
    "aionial",
    "aition",
    "ajangle",
    "ajutment",
    "akal",
    "akhmimic",
    "akinesic",
    "akinetic",
    "alacrity",
    "aladdin",
    "alantic",
    "alaric",
    "alation",
    "albinal",
    "albinic",
    "albion",
    "albitic",
    "albumean",
    "alcaic",
    "alchemic",
    "alchemy",
    "alcyonic",
    "alebion",
    "alembic",
    "alemmal",
    "aleutic",
    "alexic",
    "alexinic",
    "algal",
    "algesic",
    "algetic",
    "algic",
    "algidity",
    "algific",
    "alginic",
    "algomic",
    "algous",
    "algraphy",
    "aliment",
    "alinasal",
    "aliptic",
    "alismal",
    "alive",
    "alkalic",
    "alkalous",
    "alkylic",
    "allative",
    "allelic",
    "allergic",
    "allheal",
    "alliance",
    "allision",
    "allusion",
    "allusive",
    "alluvial",
    "allylic",
    "almous",
    "alodial",
    "aloetic",
    "alogical",
    "alphenic",
    "altaic",
    "alterity",
    "alumic",
    "aluminic",
    "alumnal",
    "amanous",
    "amarity",
    "amative",
    "amberous",
    "ambience",
    "ambiopia",
    "ambital",
    "ambition",
    "amblotic",
    "amenity",
    "ament",
    "amental",
    "ametrous",
    "amic",
    "amical",
    "amidic",
    "aminic",
    "aminity",
    "amitotic",
    "amity",
    "ammonal",
    "ammonic",
    "amnesic",
    "amnestic",
    "amniatic",
    "amnic",
    "amnionic",
    "amniotic",
    "amoebic",
    "amoebous",
    "amomal",
    "amoraic",
    "amoral",
    "amoritic",
    "amorous",
    "amorphic",
    "amotion",
    "amphoral",
    "amphoric",
    "amuletic",
    "amurcous",
    "amusive",
    "amyelic",
    "amyelous",
    "amygdal",
    "amylic",
    "amyous",
    "amytal",
    "anabatic",
    "anabolic",
    "anacusic",
    "anaemic",
    "anagogic",
    "anagraph",
    "anal",
    "analgic",
    "analogic",
    "analyse",
    "analyser",
    "analyses",
    "analysis",
    "analyst",
    "analytic",
    "analyzer",
    "anapneic",
    "anapnoic",
    "anarchal",
    "anarchic",
    "anaretic",
    "anatolic",
    "anatomic",
    "anatomy",
    "anaxial",
    "ancience",
    "anconal",
    "anconeal",
    "ancoral",
    "andesic",
    "andric",
    "anemic",
    "anemonal",
    "aneretic",
    "anergic",
    "anerotic",
    "aneuric",
    "angelic",
    "anginal",
    "anginous",
    "angled",
    "anglepod",
    "angler",
    "angles",
    "anglic",
    "angulous",
    "anhedral",
    "anhelous",
    "anhistic",
    "anhydric",
    "aniconic",
    "anilic",
    "anilidic",
    "anility",
    "animal",
    "animalia",
    "animalic",
    "animally",
    "animous",
    "anionic",
    "anisal",
    "anisic",
    "anisilic",
    "annal",
    "anneal",
    "annexal",
    "annexive",
    "annual",
    "annuity",
    "anodal",
    "anodic",
    "anodynic",
    "anoetic",
    "anogenic",
    "anomural",
    "anopubic",
    "anorgana",
    "anormal",
    "anorthic",
    "anosmic",
    "anous",
    "anoxemic",
    "anoxic",
    "ansation",
    "anserous",
    "antal",
    "anteal",
    "antennal",
    "antheral",
    "anthroic",
    "antic",
    "antical",
    "anticous",
    "antinial",
    "antinous",
    "antipyic",
    "antral",
    "anuretic",
    "anuric",
    "anurous",
    "anxious",
    "aoristic",
    "aortal",
    "aortic",
    "aosmic",
    "apagogic",
    "apatetic",
    "apathic",
    "apellous",
    "apeptic",
    "aphakial",
    "aphakic",
    "aphasic",
    "aphemic",
    "aphetic",
    "aphodal",
    "aphonic",
    "aphonous",
    "aphotic",
    "aphthic",
    "aphthous",
    "aphyric",
    "apical",
    "apioidal",
    "aplastic",
    "aplitic",
    "apneal",
    "apneic",
    "apocopic",
    "apodal",
    "apodemal",
    "apodous",
    "apogaeic",
    "apogamic",
    "apogeal",
    "apogeic",
    "apograph",
    "apohyal",
    "apologal",
    "aponic",
    "aporetic",
    "apositic",
    "apotypic",
    "appeal",
    "approval",
    "apractic",
    "apraxic",
    "apsidal",
    "aptal",
    "apteral",
    "apterial",
    "apterous",
    "aptotic",
    "apyretic",
    "apyrous",
    "aquarial",
    "aquatic",
    "aquation",
    "aqueous",
    "aquosity",
    "arabic",
    "arabinic",
    "araceous",
    "arachic",
    "aramaic",
    "araneous",
    "aration",
    "arbitral",
    "arboral",
    "arboreal",
    "arborous",
    "arcadic",
    "arcanal",
    "arcella",
    "archaic",
    "archcity",
    "archeal",
    "archival",
    "archive",
    "arctic",
    "arcual",
    "arduous",
    "ardurous",
    "areach",
    "aread",
    "areal",
    "areality",
    "arean",
    "arear",
    "areaway",
    "argal",
    "argental",
    "argentic",
    "argive",
    "argolic",
    "argotic",
    "argument",
    "argyric",
    "aridity",
    "arithmic",
    "arkosic",
    "armament",
    "armenic",
    "armorial",
    "armoric",
    "aromatic",
    "arousal",
    "arrayal",
    "arrhenal",
    "arrhizal",
    "arrival",
    "arrive",
    "arrosive",
    "arsenal",
    "arsenic",
    "arsenous",
    "arsinic",
    "arsonic",
    "artal",
    "arterial",
    "arthral",
    "arthrous",
    "artistic",
    "arval",
    "asaddle",
    "asaphic",
    "asbestic",
    "ascella",
    "ascellus",
    "ascetic",
    "ascitic",
    "ascorbic",
    "asdic",
    "aseismic",
    "aseity",
    "aseptic",
    "asexual",
    "ashplant",
    "asianic",
    "asiatic",
    "askance",
    "asocial",
    "aspartic",
    "asperity",
    "aspermic",
    "asperous",
    "aspic",
    "asporous",
    "asqueal",
    "assation",
    "assidual",
    "astatic",
    "astelic",
    "asterial",
    "asternal",
    "asthenic",
    "astomous",
    "astragal",
    "astral",
    "astucity",
    "atabal",
    "atactic",
    "ataigal",
    "ataiyal",
    "atangle",
    "atavic",
    "ataxic",
    "atechnic",
    "atheous",
    "athermic",
    "athletic",
    "athrive",
    "athymic",
    "atlantal",
    "atlantic",
    "atokal",
    "atokous",
    "atomatic",
    "atomerg",
    "atomic",
    "atomical",
    "atomics",
    "atomism",
    "atomist",
    "atomity",
    "atomize",
    "atomizer",
    "atomy",
    "atonal",
    "atonic",
    "atopic",
    "atoxic",
    "atrament",
    "atreptic",
    "atresic",
    "atretic",
    "atrial",
    "atrochal",
    "atrocity",
    "atropal",
    "atrophic",
    "atropic",
    "atropous",
    "atrous",
    "attic",
    "attical",
    "atypic",
    "atypical",
    "auantic",
    "auction",
    "audacity",
    "audience",
    "audition",
    "auditive",
    "auditual",
    "augitic",
    "augment",
    "augural",
    "augurial",
    "augurous",
    "augustal",
    "auletic",
    "aulic",
    "aumous",
    "aural",
    "aureity",
    "aureous",
    "auric",
    "aurific",
    "aurigal",
    "auronal",
    "auroral",
    "aurous",
    "austral",
    "austric",
    "autarkic",
    "autistic",
    "autoecic",
    "autopsic",
    "autoptic",
    "autumnal",
    "auxetic",
    "auxinic",
    "aval",
    "avanious",
    "avenous",
    "averment",
    "avernal",
    "averral",
    "aversion",
    "aversive",
    "aviatic",
    "aviation",
    "avidious",
    "avidity",
    "avidous",
    "avital",
    "avitic",
    "avowal",
    "avowance",
    "avulsion",
    "awabakal",
    "awater",
    "awmous",
    "axal",
    "axenic",
    "axial",
    "axiality",
    "axiation",
    "axifugal",
    "axofugal",
    "axonal",
    "axopetal",
    "ayous",
    "azelaic",
    "azohumic",
    "azoic",
    "azonal",
    "azonic",
    "azotic",
    "azotous",
    "azulmic",
    "azureous",
    "azurous",
    "azygous",
    "azymous",
    "baal",
    "babelic",
    "bacchic",
    "baconic",
    "bacteric",
    "baddish",
    "baddock",
    "badigeon",
    "badious",
    "baetylic",
    "bagplant",
    "bailment",
    "bakal",
    "balaic",
    "balance",
    "balanic",
    "baldric",
    "balearic",
    "balkanic",
    "balladic",
    "balletic",
    "balmoral",
    "balneal",
    "balsamic",
    "baltic",
    "banal",
    "banality",
    "banausic",
    "bancal",
    "bangle",
    "bangled",
    "barbal",
    "barbarea",
    "barbaric",
    "barbion",
    "barbital",
    "barcella",
    "bardic",
    "baric",
    "baronial",
    "barwal",
    "barytic",
    "basal",
    "basaltic",
    "basement",
    "basial",
    "basic",
    "basicity",
    "basidial",
    "basihyal",
    "basilic",
    "basion",
    "bastion",
    "batement",
    "bathetic",
    "bathic",
    "bathmic",
    "bathyal",
    "bathybic",
    "bayal",
    "beal",
    "bearance",
    "beatific",
    "bechance",
    "bedismal",
    "bedlamic",
    "bedral",
    "beehive",
    "begettal",
    "beglic",
    "beheadal",
    "behenic",
    "belgic",
    "belial",
    "belialic",
    "belive",
    "belleric",
    "bemangle",
    "bemeal",
    "bemean",
    "benefic",
    "bengal",
    "bengalic",
    "benthal",
    "benthic",
    "benzal",
    "benzilic",
    "benzoic",
    "benzylic",
    "bepity",
    "berascal",
    "bereason",
    "bestial",
    "bestowal",
    "betangle",
    "betrayal",
    "bewater",
    "beylic",
    "beylical",
    "bharal",
    "biannual",
    "biatomic",
    "biaxal",
    "biaxial",
    "bibacity",
    "bibasic",
    "bibation",
    "bibio",
    "bibionid",
    "biblic",
    "biblical",
    "bibulous",
    "bicaudal",
    "biconic",
    "bicrural",
    "bicursal",
    "bicycle",
    "bicycler",
    "bicyclic",
    "biddance",
    "bidental",
    "biduous",
    "biennial",
    "biethnic",
    "bifacial",
    "biferous",
    "bifidity",
    "bifocal",
    "biforous",
    "bifurcal",
    "bigamic",
    "bigamous",
    "bigonial",
    "bijasal",
    "bilabial",
    "bilianic",
    "bilic",
    "biliment",
    "bilious",
    "bimanal",
    "bimanous",
    "bimanual",
    "bimastic",
    "bimensal",
    "bimodal",
    "binal",
    "bination",
    "binaural",
    "binodal",
    "binodous",
    "binomial",
    "binormal",
    "binotic",
    "binous",
    "bioblast",
    "biochemy",
    "biochore",
    "biocycle",
    "biod",
    "biodyne",
    "biogen",
    "biogeny",
    "biograph",
    "bioherm",
    "biolith",
    "biologic",
    "biology",
    "biolysis",
    "biolytic",
    "biome",
    "biometer",
    "biometry",
    "bion",
    "bionergy",
    "bionomic",
    "bionomy",
    "biophagy",
    "biophore",
    "biophyte",
    "bioplasm",
    "bioplast",
    "biopsic",
    "biopsy",
    "bioral",
    "biorgan",
    "bios",
    "bioscope",
    "bioscopy",
    "biose",
    "biosis",
    "biota",
    "biotaxy",
    "biotic",
    "biotical",
    "biotics",
    "biotin",
    "biotite",
    "biotitic",
    "biotome",
    "biotomy",
    "biotope",
    "biotype",
    "biotypic",
    "biovular",
    "bioxide",
    "biparous",
    "bipedal",
    "biphasic",
    "biplanal",
    "biporous",
    "biracial",
    "biradial",
    "biramous",
    "biserial",
    "bisetous",
    "bisexual",
    "bitypic",
    "biunial",
    "biunity",
    "biverbal",
    "bivious",
    "bivocal",
    "bizonal",
    "bladder",
    "bladdery",
    "bludgeon",
    "boastive",
    "bocal",
    "bodement",
    "bodiment",
    "boeotic",
    "bohairic",
    "bomarea",
    "bombous",
    "boracic",
    "boracous",
    "boral",
    "boreal",
    "boric",
    "bority",
    "bornitic",
    "boronic",
    "botanic",
    "bothnic",
    "bouchal",
    "bovinity",
    "bozal",
    "brachial",
    "bracteal",
    "brahmaic",
    "brahmic",
    "brangle",
    "brangled",
    "brangler",
    "branial",
    "brassic",
    "breccial",
    "brephic",
    "brevity",
    "briarean",
    "bridal",
    "bringal",
    "brinjal",
    "bromal",
    "bromic",
    "bromidic",
    "bromous",
    "brucella",
    "brumal",
    "brumous",
    "brutal",
    "bual",
    "bubal",
    "bubonic",
    "buccal",
    "buccinal",
    "bucolic",
    "buddhic",
    "bulbous",
    "bulgaric",
    "bulimic",
    "bullous",
    "buncal",
    "buntal",
    "buoyance",
    "burgeon",
    "burghal",
    "burial",
    "burnous",
    "bursal",
    "bushment",
    "bustic",
    "butanal",
    "butanoic",
    "butic",
    "butment",
    "butylic",
    "butyral",
    "butyric",
    "butyrous",
    "byous",
    "byronic",
    "byssal",
    "cabal",
    "cabalic",
    "cabio",
    "cabiric",
    "cachemia",
    "cachemic",
    "cachexic",
    "cacozeal",
    "caddice",
    "caddiced",
    "caddie",
    "caddis",
    "caddised",
    "caddish",
    "caddle",
    "caddo",
    "caddoan",
    "caddow",
    "caddy",
    "cadence",
    "cadmean",
    "cadmic",
    "caducity",
    "caducous",
    "cadwal",
    "caecal",
    "caesious",
    "caesural",
    "caesuric",
    "caffeic",
    "cahincic",
    "cainitic",
    "calamity",
    "calcarea",
    "calcic",
    "calcific",
    "calcitic",
    "calendal",
    "calidity",
    "caliphal",
    "callosal",
    "callous",
    "caloric",
    "calvity",
    "calvous",
    "cambial",
    "cambric",
    "cameral",
    "canal",
    "cancelli",
    "cangle",
    "cangler",
    "caninal",
    "caninity",
    "cannabic",
    "cannibal",
    "canonic",
    "canopic",
    "canorous",
    "canthal",
    "cantic",
    "cantion",
    "cantonal",
    "cantoral",
    "capacity",
    "capital",
    "caporal",
    "capric",
    "caprinic",
    "caproic",
    "capronic",
    "caprylic",
    "capsizal",
    "captance",
    "caption",
    "captious",
    "captive",
    "caracal",
    "carbamic",
    "carbazic",
    "carbolic",
    "carbonic",
    "carceral",
    "cardanic",
    "cardial",
    "cardinal",
    "carditic",
    "caribal",
    "caricous",
    "carinal",
    "carious",
    "caritive",
    "carminic",
    "carnal",
    "carneous",
    "carnic",
    "carnival",
    "carnous",
    "caronic",
    "carotic",
    "carousal",
    "carpal",
    "carucal",
    "carval",
    "caryatic",
    "casal",
    "caseic",
    "casement",
    "caseous",
    "cashment",
    "castral",
    "casual",
    "cathodal",
    "cathodic",
    "catholic",
    "cation",
    "cationic",
    "catonic",
    "caucasic",
    "caudal",
    "caulomic",
    "caumatic",
    "causal",
    "caustic",
    "caution",
    "cautious",
    "caval",
    "cavernal",
    "cavity",
    "ceasmic",
    "cecity",
    "cedric",
    "celation",
    "celative",
    "celerity",
    "cella",
    "cellae",
    "cellar",
    "cellarer",
    "cellaret",
    "cellated",
    "celled",
    "cellist",
    "cellite",
    "cello",
    "celloid",
    "celloist",
    "cellose",
    "cellular",
    "cellule",
    "cellulin",
    "celtic",
    "cement",
    "cemental",
    "cenosity",
    "cenozoic",
    "censive",
    "censual",
    "cental",
    "central",
    "centric",
    "cephalic",
    "ceral",
    "ceramal",
    "ceramic",
    "ceration",
    "cerberic",
    "cercal",
    "cereal",
    "cerebral",
    "cerebric",
    "cerement",
    "cereous",
    "ceric",
    "cernuous",
    "cerotic",
    "cerous",
    "cerrial",
    "cervical",
    "cesious",
    "cession",
    "cetic",
    "cetraric",
    "cetylic",
    "chal",
    "chalazal",
    "chaldaic",
    "chamal",
    "chambioa",
    "chamisal",
    "chanabal",
    "chance",
    "chaotic",
    "charcoal",
    "charity",
    "charonic",
    "chasmal",
    "chasmic",
    "chastity",
    "chemic",
    "chemical",
    "chemis",
    "chemise",
    "chemism",
    "chemist",
    "chemosis",
    "chemotic",
    "chemung",
    "chemurgy",
    "cherubic",
    "cheval",
    "chevance",
    "chiasmal",
    "chiasmic",
    "chiastic",
    "chic",
    "chicaric",
    "chimeric",
    "chiral",
    "chital",
    "chive",
    "chloral",
    "chloric",
    "chlorous",
    "cholalic",
    "cholanic",
    "choleic",
    "choleric",
    "cholic",
    "cholinic",
    "chondral",
    "chondric",
    "chontal",
    "choragic",
    "choral",
    "chordal",
    "choreal",
    "choregic",
    "choreic",
    "chorial",
    "choric",
    "chous",
    "chrismal",
    "chromic",
    "chromous",
    "chronal",
    "chronic",
    "chrysal",
    "chthonic",
    "chudic",
    "chylific",
    "chylous",
    "chymic",
    "chymous",
    "cibarial",
    "cibation",
    "cimbric",
    "cineolic",
    "cinereal",
    "cinnamal",
    "cinnamic",
    "cinurous",
    "circinal",
    "circuity",
    "cirrhous",
    "cirrous",
    "cistic",
    "citation",
    "citral",
    "citreous",
    "citric",
    "citrous",
    "city",
    "cive",
    "civic",
    "civility",
    "cladding",
    "clarence",
    "clarity",
    "classic",
    "clastic",
    "clausal",
    "claval",
    "clavial",
    "clemence",
    "clement",
    "cleric",
    "clerical",
    "cliental",
    "climatal",
    "climatic",
    "clinal",
    "clinic",
    "clinical",
    "clithral",
    "clition",
    "clival",
    "clive",
    "cloacal",
    "clonal",
    "clonic",
    "clypeal",
    "clysmic",
    "cnemial",
    "coaction",
    "coactive",
    "coagment",
    "coal",
    "coastal",
    "coaxal",
    "coaxial",
    "cobaltic",
    "coccal",
    "coccous",
    "cochal",
    "cockal",
    "coction",
    "coderive",
    "codical",
    "coecal",
    "coelomic",
    "coenobic",
    "coequal",
    "coercive",
    "coeval",
    "cofactor",
    "cogence",
    "cognatic",
    "cogonal",
    "cohesion",
    "cohesive",
    "coinfer",
    "coital",
    "coition",
    "colation",
    "colic",
    "colical",
    "colitic",
    "colletic",
    "collinal",
    "collocal",
    "colonial",
    "colonic",
    "colossal",
    "columbic",
    "columnal",
    "colyonic",
    "colytic",
    "comal",
    "comanic",
    "comatous",
    "comedial",
    "comedian",
    "comedic",
    "comenic",
    "cometic",
    "comic",
    "comical",
    "comital",
    "comitial",
    "comity",
    "commatic",
    "commence",
    "comment",
    "communal",
    "comous",
    "comparer",
    "compital",
    "conal",
    "conarial",
    "conation",
    "conative",
    "conaxial",
    "conceal",
    "conceity",
    "conceive",
    "conchal",
    "confocal",
    "congeal",
    "conic",
    "conical",
    "conicity",
    "conidial",
    "conjugal",
    "connatal",
    "connive",
    "conoidal",
    "conoidic",
    "conormal",
    "contrive",
    "conveyal",
    "convival",
    "convive",
    "copaibic",
    "copaivic",
    "copal",
    "cophasal",
    "copious",
    "copremic",
    "coptic",
    "coracial",
    "coral",
    "corallic",
    "cordial",
    "corial",
    "cormous",
    "corneal",
    "corneous",
    "cornic",
    "cornific",
    "cornual",
    "coronal",
    "corporal",
    "corral",
    "correal",
    "corrival",
    "cortical",
    "cosmetic",
    "cosmic",
    "cosmical",
    "costal",
    "costive",
    "costumic",
    "cotidal",
    "coucal",
    "coumalic",
    "coumaric",
    "couscous",
    "covassal",
    "covetous",
    "covinous",
    "covolume",
    "cowal",
    "coxal",
    "coxalgic",
    "craddy",
    "crance",
    "cranial",
    "cranic",
    "crankous",
    "crateral",
    "creance",
    "creatic",
    "creation",
    "creative",
    "crebrity",
    "crebrous",
    "credence",
    "creedal",
    "crenic",
    "crenitic",
    "crepance",
    "crescive",
    "cresotic",
    "cresylic",
    "cretacic",
    "cretic",
    "cretinic",
    "cretion",
    "cribral",
    "cric",
    "crimean",
    "criminal",
    "crinal",
    "crisic",
    "crissal",
    "critic",
    "critical",
    "croceic",
    "croceous",
    "croconic",
    "crotal",
    "crotalic",
    "crotonic",
    "croupal",
    "croupous",
    "crucial",
    "crudity",
    "cruive",
    "crumenal",
    "crunodal",
    "crural",
    "crustal",
    "cryptal",
    "cryptic",
    "cryptous",
    "crystal",
    "crystic",
    "cubangle",
    "cubic",
    "cubical",
    "cubicity",
    "cubital",
    "cuboidal",
    "culminal",
    "culottic",
    "cultic",
    "cultual",
    "cultural",
    "cumal",
    "cumbrous",
    "cumhal",
    "cumic",
    "cuminal",
    "cuminic",
    "cumulous",
    "cuneal",
    "cuneatic",
    "cupidity",
    "cupreous",
    "cupric",
    "cuprous",
    "curatial",
    "curatic",
    "curation",
    "curative",
    "curial",
    "curious",
    "cursal",
    "cursive",
    "curtal",
    "curvital",
    "curvity",
    "curvous",
    "cushitic",
    "cuspal",
    "cuspidal",
    "custumal",
    "cutaneal",
    "cutheal",
    "cutwater",
    "cyaneous",
    "cyanic",
    "cyanotic",
    "cyanuric",
    "cycladic",
    "cycle",
    "cyclecar",
    "cycledom",
    "cyclene",
    "cycler",
    "cyclic",
    "cyclical",
    "cyclitic",
    "cyclonal",
    "cyclonic",
    "cyclopic",
    "cygneous",
    "cymation",
    "cymbal",
    "cymous",
    "cymric",
    "cynic",
    "cynical",
    "cyrenaic",
    "cyrillic",
    "cystal",
    "cystic",
    "cystous",
    "cytasic",
    "cytozoic",
    "czaric",
    "czechic",
    "dacitic",
    "dacoity",
    "dactylic",
    "dadder",
    "daddle",
    "daddock",
    "daddocky",
    "daddy",
    "daddynut",
    "daedal",
    "daedalic",
    "daemonic",
    "daimonic",
    "dalmatic",
    "daltonic",
    "damnous",
    "dance",
    "dangle",
    "dangler",
    "danic",
    "danielic",
    "dardic",
    "dareall",
    "daric",
    "dartoic",
    "dartrous",
    "dation",
    "datival",
    "dative",
    "daturic",
    "davidic",
    "dayal",
    "dazement",
    "deaconal",
    "deal",
    "dearth",
    "dearthfu",
    "debility",
    "decadal",
    "decadic",
    "decal",
    "decanal",
    "decatoic",
    "deceive",
    "decence",
    "decennal",
    "decidual",
    "decision",
    "decisive",
    "declinal",
    "declive",
    "decoic",
    "decorous",
    "decretal",
    "decrial",
    "decylic",
    "dedition",
    "deducive",
    "defence",
    "deferral",
    "defial",
    "defiance",
    "defluous",
    "deforce",
    "deforcer",
    "defrayal",
    "defusion",
    "deicidal",
    "deictic",
    "deific",
    "deifical",
    "deiseal",
    "deistic",
    "deity",
    "delation",
    "deletion",
    "deletive",
    "deltaic",
    "deltal",
    "deltic",
    "delusion",
    "delusive",
    "demal",
    "demean",
    "demeanor",
    "dement",
    "demersal",
    "demonial",
    "demonic",
    "demotic",
    "demotion",
    "demurity",
    "demurral",
    "dendral",
    "dendric",
    "denial",
    "denotive",
    "dental",
    "dentical",
    "dentinal",
    "dentural",
    "depilous",
    "deposal",
    "deprival",
    "deprive",
    "deric",
    "derision",
    "derisive",
    "derival",
    "derive",
    "dermal",
    "dermatic",
    "dermic",
    "descale",
    "descrive",
    "desertic",
    "desirous",
    "desition",
    "desmic",
    "despisal",
    "despotic",
    "detainal",
    "detrital",
    "deuteric",
    "devance",
    "devious",
    "devisal",
    "devonic",
    "devotion",
    "dewater",
    "dextral",
    "dextrous",
    "dhyal",
    "diabasic",
    "diabetic",
    "diabolic",
    "diacetic",
    "diaconal",
    "diagonal",
    "diagonic",
    "diagraph",
    "dial",
    "dialogic",
    "dialuric",
    "dialytic",
    "diambic",
    "dianodal",
    "diapnoic",
    "diarchic",
    "diarial",
    "diastral",
    "diatom",
    "diatoma",
    "diatomic",
    "diatomin",
    "diatonic",
    "diatoric",
    "diaulic",
    "diaxial",
    "diazoic",
    "diazotic",
    "dibasic",
    "dicalcic",
    "dicastic",
    "dicerous",
    "dichotic",
    "dichroic",
    "diclinic",
    "dicolic",
    "dicrotal",
    "dicrotic",
    "dictic",
    "diction",
    "dicycle",
    "dicyclic",
    "didactic",
    "didymous",
    "diedral",
    "diedric",
    "dietal",
    "dietetic",
    "dietic",
    "digallic",
    "digammic",
    "digamous",
    "digenic",
    "digenous",
    "digital",
    "dignity",
    "digonous",
    "digraph",
    "digynous",
    "dihedral",
    "dihydric",
    "dilation",
    "dilative",
    "dilution",
    "dilutive",
    "diluvial",
    "dimeric",
    "dimerous",
    "dimetric",
    "dimity",
    "dimoric",
    "dimyaric",
    "dinaric",
    "dineric",
    "dineuric",
    "dinic",
    "dinical",
    "dinomic",
    "diogenic",
    "dioicous",
    "dionymal",
    "dioptral",
    "dioptric",
    "dioramic",
    "dioritic",
    "diotic",
    "diphasic",
    "diplasic",
    "diploic",
    "diplopic",
    "dipnoous",
    "dipodic",
    "dipsetic",
    "dipteral",
    "diriment",
    "discal",
    "discous",
    "disemic",
    "disloyal",
    "dismal",
    "disodic",
    "disomic",
    "dispetal",
    "displant",
    "disposal",
    "distal",
    "distance",
    "disunity",
    "dital",
    "dithecal",
    "dithioic",
    "ditokous",
    "diuretic",
    "diurnal",
    "dive",
    "divided",
    "dividend",
    "divider",
    "dividual",
    "divinity",
    "division",
    "divisive",
    "dizoic",
    "docetic",
    "docility",
    "docity",
    "doctoral",
    "document",
    "doeglic",
    "dogal",
    "dogmatic",
    "doketic",
    "dolmenic",
    "dolorous",
    "dolous",
    "domainal",
    "domal",
    "domanial",
    "doment",
    "domestic",
    "domic",
    "domical",
    "dominial",
    "dominic",
    "domitic",
    "donal",
    "donation",
    "donative",
    "doncella",
    "doric",
    "dorical",
    "dornic",
    "dorsal",
    "dossal",
    "dotal",
    "dotation",
    "doubtous",
    "doutous",
    "doweral",
    "doxastic",
    "drachmal",
    "draconic",
    "dramatic",
    "drastic",
    "dravidic",
    "drive",
    "dromic",
    "druidic",
    "drupal",
    "dryadic",
    "drycoal",
    "duadic",
    "dual",
    "duality",
    "dubious",
    "ducal",
    "duction",
    "dudgeon",
    "dugal",
    "dullity",
    "dulotic",
    "dumosity",
    "dunal",
    "duncical",
    "dungeon",
    "duodenal",
    "duograph",
    "dural",
    "durance",
    "duration",
    "durative",
    "durity",
    "duteous",
    "dyadic",
    "dyarchic",
    "dyassic",
    "dynamic",
    "dysbulic",
    "dysgenic",
    "dyspneal",
    "dyspneic",
    "dyspnoic",
    "dystomic",
    "dysuric",
    "earth",
    "earthed",
    "earthen",
    "earthian",
    "earthkin",
    "earthly",
    "earthnut",
    "earthpea",
    "earthy",
    "easement",
    "ebeneous",
    "ebionism",
    "ebionite",
    "ebionize",
    "ebrious",
    "ecbatic",
    "ecbolic",
    "eccritic",
    "ecdemic",
    "ecesic",
    "echinal",
    "echoic",
    "eclectic",
    "ecliptic",
    "eclosion",
    "ecologic",
    "economic",
    "ecotonal",
    "ecotypic",
    "ecstatic",
    "ectal",
    "ectatic",
    "ectental",
    "ectopic",
    "ectozoic",
    "ectypal",
    "ecumenic",
    "edacious",
    "edacity",
    "edaphic",
    "eddaic",
    "eddic",
    "edemic",
    "edenic",
    "edental",
    "edictal",
    "edital",
    "edition",
    "educive",
    "eduction",
    "eductive",
    "effigial",
    "effusion",
    "effusive",
    "egality",
    "egence",
    "egestion",
    "egestive",
    "eggplant",
    "egoistic",
    "egoity",
    "eidetic",
    "eidolic",
    "eisodic",
    "ejection",
    "ejective",
    "elaidic",
    "elamitic",
    "elance",
    "elastic",
    "elation",
    "elative",
    "eleatic",
    "election",
    "elective",
    "electric",
    "elegance",
    "elenchic",
    "elenctic",
    "elfic",
    "elianic",
    "elision",
    "ellagic",
    "elliptic",
    "elohimic",
    "elric",
    "elusion",
    "elusive",
    "elution",
    "eluvial",
    "elydoric",
    "elytral",
    "elytrous",
    "embelic",
    "embiodea",
    "emblic",
    "embolic",
    "embryous",
    "emersion",
    "emetic",
    "emiction",
    "eminence",
    "emission",
    "emissive",
    "emmenic",
    "emmental",
    "emotion",
    "emotive",
    "empathic",
    "emphatic",
    "empiric",
    "emporial",
    "emption",
    "empyemic",
    "empyreal",
    "emulous",
    "emulsion",
    "emulsive",
    "enaction",
    "enactive",
    "enatic",
    "enation",
    "encell",
    "encinal",
    "enclitic",
    "encomic",
    "encraal",
    "encratic",
    "encrinal",
    "encrinic",
    "encyclic",
    "endemial",
    "endemic",
    "endermic",
    "endive",
    "endoral",
    "endymal",
    "energic",
    "enfamous",
    "enforce",
    "enforced",
    "enforcer",
    "enginous",
    "engraphy",
    "enhance",
    "enkraal",
    "enmity",
    "enneadic",
    "enneatic",
    "ennoic",
    "ennomic",
    "enochic",
    "enodal",
    "enolic",
    "enormity",
    "enormous",
    "enrive",
    "ensandal",
    "ensuance",
    "ental",
    "entangle",
    "enteral",
    "enteric",
    "entheal",
    "enthetic",
    "enthral",
    "entity",
    "entohyal",
    "entomic",
    "entopic",
    "entoptic",
    "entotic",
    "entozoal",
    "entozoic",
    "entrance",
    "enuretic",
    "envassal",
    "envious",
    "envision",
    "envolume",
    "enzootic",
    "enzymic",
    "eolation",
    "eolithic",
    "eophytic",
    "eosinic",
    "eozoic",
    "eozoonal",
    "epacmaic",
    "epactal",
    "epagogic",
    "epaxial",
    "epeiric",
    "ephebic",
    "ephectic",
    "ephetic",
    "ephoral",
    "ephoric",
    "epibasal",
    "epibolic",
    "epic",
    "epical",
    "epicolic",
    "epicycle",
    "epidemic",
    "epidotic",
    "epidural",
    "epifocal",
    "epigamic",
    "epigeal",
    "epigeic",
    "epigenic",
    "epigeous",
    "epigonal",
    "epigonic",
    "epigraph",
    "epihyal",
    "epilogic",
    "epimeral",
    "epimeric",
    "epiotic",
    "epipial",
    "epiploic",
    "epipolic",
    "epipubic",
    "epirotic",
    "episodal",
    "episodic",
    "epitomic",
    "epitonic",
    "epiural",
    "epizoal",
    "epizoic",
    "epochal",
    "epodic",
    "eponymic",
    "epoptic",
    "epulotic",
    "epural",
    "equaeval",
    "equality",
    "equinity",
    "equity",
    "eral",
    "erasion",
    "erection",
    "erective",
    "eremic",
    "eremital",
    "eremitic",
    "ereptic",
    "ereption",
    "erethic",
    "ergal",
    "ergastic",
    "ergodic",
    "ergotic",
    "eric",
    "erical",
    "ericetal",
    "eristic",
    "erogenic",
    "erosive",
    "erotetic",
    "erotic",
    "erotical",
    "erratic",
    "erucic",
    "eruction",
    "eruption",
    "eruptive",
    "escambio",
    "eschewal",
    "escorial",
    "esexual",
    "eskimoic",
    "esodic",
    "esoteric",
    "especial",
    "espial",
    "espinal",
    "espousal",
    "essence",
    "essenic",
    "estadal",
    "estival",
    "estrous",
    "estrual",
    "estuous",
    "eternal",
    "eternity",
    "ethal",
    "ethanal",
    "ethenic",
    "ethereal",
    "etheric",
    "etherous",
    "ethic",
    "ethical",
    "ethionic",
    "ethiopic",
    "ethnal",
    "ethnic",
    "ethnical",
    "ethylic",
    "etymic",
    "etymonic",
    "etypic",
    "etypical",
    "euboic",
    "euchroic",
    "euconic",
    "euctical",
    "eucyclic",
    "eugenic",
    "euhedral",
    "eulogic",
    "eunuchal",
    "eupeptic",
    "euphonic",
    "euphoric",
    "eurafric",
    "eurindic",
    "euskaric",
    "eustatic",
    "eutaxic",
    "eutectic",
    "eutomous",
    "eutropic",
    "evasion",
    "evasive",
    "evection",
    "eventual",
    "eversion",
    "eversive",
    "eviction",
    "evincive",
    "evulsion",
    "exaction",
    "exactive",
    "exarchal",
    "exarchic",
    "excision",
    "excitive",
    "excretal",
    "excusal",
    "excusive",
    "exegetic",
    "exequial",
    "exergual",
    "exertion",
    "exertive",
    "exigence",
    "exiguity",
    "exiguous",
    "exilic",
    "exility",
    "eximious",
    "exition",
    "exodic",
    "exogamic",
    "exogenic",
    "exordial",
    "exosmic",
    "exoteric",
    "exotic",
    "exotoxic",
    "explant",
    "exposal",
    "exrupeal",
    "external",
    "extusion",
    "exudence",
    "exumbral",
    "exuvial",
    "eyewater",
    "fabric",
    "fabulous",
    "facadal",
    "facial",
    "facility",
    "faction",
    "factious",
    "factive",
    "factory",
    "factual",
    "faculous",
    "faddish",
    "faddism",
    "faddist",
    "faddle",
    "faddy",
    "faience",
    "fakement",
    "falcial",
    "falderal",
    "familial",
    "famous",
    "fanal",
    "fanatic",
    "fancical",
    "fangle",
    "fangled",
    "fangless",
    "fanglet",
    "faradaic",
    "faradic",
    "farcial",
    "farcical",
    "fascial",
    "fashious",
    "fastuous",
    "fatal",
    "fatality",
    "fatidic",
    "fatuity",
    "fatuous",
    "faucal",
    "faucial",
    "faunal",
    "favous",
    "fayal",
    "fayumic",
    "feal",
    "feasance",
    "featous",
    "featural",
    "febrific",
    "fecal",
    "federal",
    "fehmic",
    "felicity",
    "felinity",
    "fellic",
    "fellinic",
    "felsitic",
    "femality",
    "femic",
    "feminal",
    "feminity",
    "femoral",
    "fence",
    "fensive",
    "feodal",
    "feracity",
    "feral",
    "ferial",
    "ferity",
    "ferment",
    "ferocity",
    "ferreous",
    "ferric",
    "ferrous",
    "ferulic",
    "festal",
    "festival",
    "festive",
    "fetal",
    "fetation",
    "fetial",
    "fetidity",
    "fetishic",
    "feudal",
    "feverous",
    "fiance",
    "fibrotic",
    "fibrous",
    "ficelle",
    "fiction",
    "fictious",
    "fictive",
    "fidation",
    "fidelity",
    "fiducial",
    "figment",
    "figural",
    "figurial",
    "filament",
    "filarial",
    "filial",
    "filical",
    "filicic",
    "filmic",
    "fimbrial",
    "finality",
    "finance",
    "findal",
    "finement",
    "fingal",
    "finial",
    "finical",
    "finific",
    "finitive",
    "finity",
    "finnic",
    "firmance",
    "fiscal",
    "fission",
    "fissive",
    "fissural",
    "fistic",
    "fistical",
    "fitment",
    "five",
    "fixation",
    "fixative",
    "fixidity",
    "fixity",
    "flavic",
    "flection",
    "flexuous",
    "flexural",
    "floative",
    "floral",
    "floreal",
    "florence",
    "fluidal",
    "fluidic",
    "fluidity",
    "fluoric",
    "fluvial",
    "foal",
    "focal",
    "folial",
    "folious",
    "foment",
    "fontal",
    "fontinal",
    "forced",
    "forcedly",
    "forceful",
    "forceps",
    "forcer",
    "forelive",
    "foremean",
    "forensal",
    "forensic",
    "forestal",
    "forgive",
    "formal",
    "formenic",
    "formic",
    "formylal",
    "fornacic",
    "fornical",
    "fortuity",
    "fotmal",
    "foveal",
    "foyaitic",
    "frabjous",
    "frabous",
    "fragment",
    "francic",
    "frantic",
    "frederic",
    "freity",
    "frenal",
    "frenetic",
    "friesic",
    "frigoric",
    "frolic",
    "frondous",
    "frontal",
    "frugal",
    "fruition",
    "fruitive",
    "fruity",
    "fucation",
    "fucoidal",
    "fucous",
    "fugacity",
    "fugal",
    "fugitive",
    "fulcral",
    "fulgural",
    "fulminic",
    "fulvous",
    "fumaric",
    "fumosity",
    "fumous",
    "fundal",
    "fundic",
    "funeral",
    "funereal",
    "fungal",
    "fungic",
    "fungous",
    "furacity",
    "fural",
    "furcal",
    "furfural",
    "furilic",
    "furious",
    "furoic",
    "furtive",
    "fusarial",
    "fuscous",
    "fusion",
    "fusional",
    "fusteric",
    "fustic",
    "futility",
    "futural",
    "futuric",
    "futurity",
    "gabbroic",
    "gabion",
    "gabioned",
    "gaddang",
    "gadded",
    "gadder",
    "gaddi",
    "gadding",
    "gaddish",
    "gaelic",
    "galactic",
    "galatic",
    "galchic",
    "galenic",
    "galgal",
    "gallic",
    "gallous",
    "galvanic",
    "gambodic",
    "gambogic",
    "gametal",
    "gametic",
    "gamic",
    "gangetic",
    "ganglial",
    "ganoidal",
    "gaonic",
    "garance",
    "garial",
    "garlic",
    "garment",
    "gaseity",
    "gaseous",
    "gastral",
    "gastric",
    "gathic",
    "gaulic",
    "gavial",
    "gayal",
    "gayment",
    "gazement",
    "gazettal",
    "geal",
    "gelastic",
    "gelation",
    "gelidity",
    "gelsemic",
    "gemaric",
    "geminous",
    "gemmeous",
    "genal",
    "generic",
    "generous",
    "genesial",
    "genesic",
    "genetous",
    "genial",
    "genic",
    "genital",
    "genitive",
    "genomic",
    "gentilic",
    "gentisic",
    "genual",
    "geobiont",
    "geobios",
    "geoblast",
    "geodal",
    "geode",
    "geodesic",
    "geodesy",
    "geodete",
    "geodetic",
    "geodic",
    "geodist",
    "geoduck",
    "geoff",
    "geoffrey",
    "geoform",
    "geogenic",
    "geogeny",
    "geognost",
    "geognosy",
    "geogonic",
    "geogony",
    "geoid",
    "geoidal",
    "geolatry",
    "geologer",
    "geologic",
    "geology",
    "geomalic",
    "geomaly",
    "geomance",
    "geomancy",
    "geomant",
    "geometer",
    "geometry",
    "geomoroi",
    "geomyid",
    "geomys",
    "geon",
    "geonic",
    "geonim",
    "geonoma",
    "geophagy",
    "geophila",
    "geophone",
    "geophyte",
    "geoplana",
    "geopolar",
    "geoponic",
    "geopony",
    "georama",
    "geordie",
    "george",
    "georgia",
    "georgian",
    "georgic",
    "georgie",
    "geoscopy",
    "geosid",
    "geoside",
    "geospiza",
    "geotaxis",
    "geotaxy",
    "geotherm",
    "geotic",
    "geotical",
    "geotilla",
    "geotonic",
    "geotonus",
    "geotropy",
    "geoty",
    "geranial",
    "geranic",
    "geratic",
    "germal",
    "germanic",
    "germinal",
    "gerontal",
    "gerontic",
    "gestic",
    "gestical",
    "gestion",
    "gestural",
    "getic",
    "geyseral",
    "geyseric",
    "gharial",
    "ghatwal",
    "gibbous",
    "gigantic",
    "gigmanic",
    "gimbal",
    "gimmal",
    "gingival",
    "give",
    "glabrous",
    "glacial",
    "gladden",
    "gladdon",
    "gladdy",
    "glagolic",
    "glaive",
    "glance",
    "glareous",
    "glaucous",
    "glebal",
    "glebous",
    "glial",
    "global",
    "globous",
    "gloeal",
    "glorious",
    "glossal",
    "glossic",
    "glottal",
    "glottic",
    "glucidic",
    "glucinic",
    "glucosic",
    "glumal",
    "glutamic",
    "glutaric",
    "gluteal",
    "glyceric",
    "glycidic",
    "glycolic",
    "glyconic",
    "glyoxal",
    "glyphic",
    "glyptic",
    "gnathal",
    "gnathic",
    "gneissic",
    "gnomic",
    "gnomical",
    "gnomonic",
    "gnostic",
    "goal",
    "gobio",
    "gobioid",
    "goetic",
    "goetical",
    "goidelic",
    "goitral",
    "goitrous",
    "goldic",
    "gomeral",
    "gonadal",
    "gonadial",
    "gonadic",
    "gonal",
    "gonial",
    "gonidial",
    "gonidic",
    "gonimic",
    "gonimous",
    "gonydeal",
    "gonydial",
    "goral",
    "gorbal",
    "gorgeous",
    "goric",
    "gothic",
    "gothonic",
    "gracious",
    "gradal",
    "graddan",
    "gradual",
    "grallic",
    "granitic",
    "graphic",
    "graphics",
    "graphis",
    "graphite",
    "graphium",
    "graphy",
    "gratiola",
    "gratuity",
    "gravic",
    "gregal",
    "gremial",
    "grievous",
    "gripment",
    "grippal",
    "griseous",
    "gromatic",
    "grumous",
    "guanylic",
    "guarea",
    "gudgeon",
    "guelphic",
    "guemal",
    "guestive",
    "gugal",
    "guidance",
    "guildic",
    "gulonic",
    "gulosity",
    "gummous",
    "gumption",
    "gunation",
    "gurgeon",
    "gurgeons",
    "guric",
    "gutnic",
    "guttural",
    "gymnasic",
    "gymnemic",
    "gymnic",
    "gymnical",
    "gynecic",
    "gynic",
    "gypseous",
    "gypsous",
    "gyral",
    "gyration",
    "gyric",
    "gyroidal",
    "gyrous",
    "habenal",
    "hability",
    "habitual",
    "hadden",
    "haddie",
    "haddo",
    "haddock",
    "haggadic",
    "haikal",
    "hairmeal",
    "haithal",
    "halakic",
    "halal",
    "halation",
    "halibios",
    "halimous",
    "halinous",
    "hallucal",
    "halobios",
    "hamal",
    "hamital",
    "hamitic",
    "hamous",
    "hance",
    "hangle",
    "hangment",
    "hannibal",
    "haptenic",
    "haptic",
    "harmal",
    "harminic",
    "harmonic",
    "hartal",
    "hasidic",
    "hathoric",
    "hattic",
    "haustral",
    "heal",
    "hearth",
    "heavity",
    "hebamic",
    "hebetic",
    "hebraic",
    "hecatic",
    "hecatomb",
    "heckimal",
    "hectic",
    "hectical",
    "hederic",
    "hedonic",
    "heinous",
    "helcotic",
    "heliacal",
    "helical",
    "helladic",
    "hellenic",
    "helvetic",
    "hemal",
    "hematal",
    "hematic",
    "hematoma",
    "hemic",
    "hemiolic",
    "hemiopic",
    "hemipic",
    "hence",
    "henotic",
    "hepatic",
    "hepatoma",
    "heptal",
    "heptoic",
    "heptylic",
    "heraldic",
    "herbal",
    "herbous",
    "herdic",
    "heredity",
    "heretic",
    "hermaic",
    "hermetic",
    "hermitic",
    "hernial",
    "heroic",
    "heroical",
    "herpetic",
    "hesiodic",
    "hesperic",
    "hetaeric",
    "heteric",
    "heuretic",
    "hexadic",
    "hexoic",
    "hexonic",
    "hexylic",
    "hiatal",
    "hiation",
    "hibernal",
    "hibernic",
    "hidation",
    "hideous",
    "hidrotic",
    "hiemal",
    "hieratic",
    "hilarity",
    "hilasmic",
    "himation",
    "himyaric",
    "hippic",
    "hippuric",
    "hispanic",
    "histonal",
    "historic",
    "hive",
    "holistic",
    "holmic",
    "holoptic",
    "holozoic",
